app/views/boards/show.html.erb

SELECT "lists".* FROM "lists" WHERE "lists"."board_id" = $1  [["board_id", 1]]
---
    <% if @board.lists %>
      <% @board.lists.each do |list| %>

SELECT "cards".* FROM "cards" WHERE "cards"."list_id" = $1  [["list_id", 1]]
---
          <ul id="sortable<%= list.id %>" class="connectedSortable">
            <% list.cards.each do |card| %>