app/controllers/boards_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
  def index
    @user = User.find_by(id: params[:user_id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "boards".* FROM "boards" WHERE "boards"."id" = $1 LIMIT 1  [["id", 1]]
---
  def show
    @user = User.find_by(id: params[:user_id])
    @board = Board.find_by(id: params[:id])