app/controllers/cards_controller.rb

SELECT  "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT 1  [["id", 7]]
---
  def show
    p params
    card = Card.find_by(id: params[:id])

INSERT INTO "cards" ("list_id", "organization_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["list_id", 1], ["organization_name", "Trello"], ["created_at", "2015-04-24 23:11:36.077106"], ["updated_at", "2015-04-24 23:11:36.077106"]]
---
  def create
    card = Card.new(list_id: 1, organization_name: params[:organization_name])
    if card.save

SELECT  "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT 1  [["id", 4]]
UPDATE "cards" SET "organization_name" = $1, "organization_summary" = $2, "updated_at" = $3 WHERE "cards"."id" = $4  [["organization_name", "Pending"], ["organization_summary", "sdfasdf"], ["updated_at", "2015-04-30 18:56:06.577506"], ["id", 23]]
INSERT INTO "movements" ("current_list", "card_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["current_list", "4"], ["card_id", 3], ["created_at", "2015-04-25 01:00:54.178935"], ["updated_at", "2015-04-25 01:00:54.178935"]]
---
  def update
    card = Card.find_by(id: params[:card_id])
    if params[:list_id].nil?
      card.update_attributes(organization_name: params[:organization_name],
                            organization_summary: params[:organization_summary])
      render json: card
    else
      card.list_id = params[:list_id]
      if card.save
        movement = card.movements.new(current_list: params[:list_id], card_id: card.id)
        if movement.save