app/controllers/movements_controller.rb

  def create
    card = Card.find_by(params[:id])
    card.update_attributes(list_id: params[:list_id])
    if card.save
      movement = card.movements.new(current_list: params[:list_id],
                                    card_id: card.id)
      if movement.save
---
UPDATE "cards" SET "list_id" = $1, "updated_at" = $2 WHERE "cards"."id" = $3  [["list_id", 2], ["updated_at", "2015-05-01 18:40:52.178061"], ["id", 1]]
INSERT INTO "movements" ("current_list", "card_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["current_list", "2"], ["card_id", 1], ["created_at", "2015-04-30 18:54:37.236552"], ["updated_at", "2015-04-30 18:54:37.236552"]]